app/Controllers/Parkir.php

    public function search_car()
    {
        $keyword = $_POST['keyword'];
        $result  = $this->parkir->select('*')->join('tb_model_kendaraan', 'tb_parking.model_code = tb_model_kendaraan.model_code')->like('license_plate', $keyword)->limit(4)->get()->getResultArray();
---
SELECT *
FROM `tb_parking`
JOIN `tb_model_kendaraan` ON `tb_parking`.`model_code` = `tb_model_kendaraan`.`model_code`
WHERE `license_plate` LIKE '%B78ASDSA%' ESCAPE '!'
 LIMIT 4