app/Models/ParkirModel.php

SELECT *
FROM `tb_model_kendaraan`
ORDER BY `model` ASC
---
    public function _getListModel()
    {
        $db      = \Config\Database::connect();
        $builder = $db->table("tb_model_kendaraan");

        return $builder
            ->select('*')
            ->orderBy('model', 'ASC')
            ->get()
            ->getResultArray();

SELECT *
FROM `tb_model_kendaraan`
LEFT JOIN `tb_parking` ON `tb_parking`.`model_code` = `tb_model_kendaraan`.`model_code`
WHERE `grup` = 'B'
AND `position` = '1'
AND `created_at` = '2025-07-21'
---
    public function _getParkirDetail($posisi, $grup, $date)
    {
        $db      = \Config\Database::connect();
        $builder = $db->table("tb_model_kendaraan");
        return $builder->select('*')->join('tb_parking', 'tb_parking.model_code = tb_model_kendaraan.model_code', 'LEFT')->where('grup', $grup)->where('position', $posisi)->where('created_at', $date)->get()->getFirstRow();

SELECT *
FROM `tb_user`
WHERE `email` = 'admin'
---
    public function _getUserByEmail($email)
    {
        $db      = \Config\Database::connect();
        $builder = $db->table("tb_user");
        $builder->select('*')->where('email', $email);
        return $builder->get()->getRowArray();